In [2]:
import sqlite3

# Connects to an existing database,
# IF DB doesn't exist then it will be created.

conn = sqlite3.connect('test.db')
print('Success')

Success

# Create a Table

In [4]:
conn.execute('CREATE TABLE EMP(ID INT PRIMARY KEY NOT NULL,\
                                NAME TEXT NOT NULL,\
                                AGE INT NOT NULL,\
                                ADDRESS CHAR(50),\
                                SALARY REAL);')
print('Table created successfully')

Table created successfully

# Insert data

In [12]:
conn.execute("INSERT INTO EMP(ID, NAME, AGE, ADDRESS, SALARY)\
              VALUES (1, 'VIPUL', 22, 'Mumbai', 1000)")
conn.execute("INSERT INTO EMP(ID, NAME, AGE, ADDRESS, SALARY)\
              VALUES (2, 'AAKASH', 22, 'Pune', 2000)")
conn.execute("INSERT INTO EMP(ID, NAME, AGE, ADDRESS, SALARY)\
              VALUES (3, 'Anuj', 23, 'Ahmedabad', 3000)")
conn.execute("INSERT INTO EMP(ID, NAME, AGE, ADDRESS, SALARY)\
              VALUES (4, 'Rahul', 22, 'Chennai', 4000)")
conn.execute("INSERT INTO EMP(ID, NAME, AGE, ADDRESS, SALARY)\
              VALUES (5, 'Prathamesh', 22, 'Goa', 5000)")

# Select Operation

In [17]:
query = conn.execute('SELECT * FROM EMP')
for row in query:
    print('ID = ', row[0])
    print('NAME = ', row[1])
    print('AGE = ', row[2])
    print('ADDRESS = ', row[3])    
    print('SALARY = ', row[4], '\n')

ID =  1
NAME =  VIPUL
AGE =  22
ADDRESS =  Mumbai
SALARY =  1000.0

ID =  2
NAME =  AAKASH
AGE =  22
ADDRESS =  Pune
SALARY =  2000.0

ID =  3
NAME =  Anuj
AGE =  23
ADDRESS =  Ahmedabad
SALARY =  3000.0

ID =  4
NAME =  Rahul
AGE =  22
ADDRESS =  Chennai
SALARY =  4000.0

ID =  5
NAME =  Prathamesh
AGE =  22
ADDRESS =  Goa
SALARY =  5000.0

Or you can use pandas dataframe

In [14]:
import pandas as pd
print(pd.read_sql_query('SELECT * FROM EMP', conn))

   ID        NAME  AGE    ADDRESS  SALARY
0   1       VIPUL   22     Mumbai  1000.0
1   2      AAKASH   22       Pune  2000.0
2   3        Anuj   23  Ahmedabad  3000.0
3   4       Rahul   22    Chennai  4000.0
4   5  Prathamesh   22        Goa  5000.0

# Update Operation

In [19]:
conn.execute('UPDATE EMP SET SALARY=10000 WHERE ID=1')
conn.commit
# print('Total changes / row updated ', conn.total_changes)

print(pd.read_sql_query('SELECT * FROM EMP', conn))

   ID        NAME  AGE    ADDRESS   SALARY
0   1       VIPUL   22     Mumbai  10000.0
1   2      AAKASH   22       Pune   2000.0
2   3        Anuj   23  Ahmedabad   3000.0
3   4       Rahul   22    Chennai   4000.0
4   5  Prathamesh   22        Goa   5000.0

# Delete Operation

In [21]:
conn.execute('DELETE FROM EMP WHERE ID=5;')
conn.commit
# print('Total rows deleted: ', conn.total_changes)

print(pd.read_sql_query('SELECT * FROM EMP', conn))

   ID    NAME  AGE    ADDRESS   SALARY
0   1   VIPUL   22     Mumbai  10000.0
1   2  AAKASH   22       Pune   2000.0
2   3    Anuj   23  Ahmedabad   3000.0
3   4   Rahul   22    Chennai   4000.0